Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/azurerm...
- Installing hashicorp/azurerm v2.64.0...
- Installed hashicorp/azurerm v2.64.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_service_plan.elastic will be created
  + resource "azurerm_app_service_plan" "elastic" {
      + id                           = (known after apply)
      + kind                         = "elastic"
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "api-appserviceplan-pro"
      + reserved                     = false
      + resource_group_name          = "DEV-RG1"

      + sku {
          + capacity = 1
          + size     = "EP2"
          + tier     = "Basic"
        }
    }

  # azurerm_linux_virtual_machine.my_vm will be created
  + resource "azurerm_linux_virtual_machine" "my_vm" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "fakeuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "eastus"
      + max_bid_price                   = -1
      + name                            = "atlantis-test"
      + network_interface_ids           = [
          + "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/testrg/providers/Microsoft.Network/networkInterfaces/fakenic",
        ]
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "DEV-RG1"
      + size                            = "Standard_B2ms"
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "16.04-LTS"
          + version   = "latest"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/atlantis/.atlantis/repos/ajinkya101/infracost-azure-atlantis/1/default/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/ajinkya101/infracost-azure-atlantis/1/default/default.tfplan"

Detected Terraform directory at .
[K  [96;1m⠋[0m Running terraform plan [K  [96;1m⠙[0m Running terraform plan [K  [96;1m⠹[0m Running terraform plan [K  [96;1m⠸[0m Running terraform plan [K  [96;1m⠼[0m Running terraform plan [K  [96;1m⠴[0m Running terraform plan [K  [96;1m⠦[0m Running terraform plan [K  [96;1m⠧[0m Running terraform plan [K  [96;1m⠇[0m Running terraform plan [K  [96;1m⠏[0m Running terraform plan [K  [96;1m⠋[0m Running terraform plan [K  [96;1m⠙[0m Running terraform plan [K  [96;1m⠹[0m Running terraform plan [K  [96;1m⠸[0m Running terraform plan [K  [96;1m⠼[0m Running terraform plan [K  [96;1m⠴[0m Running terraform plan [K  [96;1m⠦[0m Running terraform plan [K  [96;1m⠧[0m Running terraform plan [K  [96;1m⠇[0m Running terraform plan [K  [96;1m⠏[0m Running terraform plan [K  [96;1m⠋[0m Running terraform plan [K  [96;1m⠙[0m Running terraform plan [K  [96;1m⠹[0m Running terraform plan [K  [96;1m⠸[0m Running terraform plan [K  [96;1m⠼[0m Running terraform plan [K  [96;1m⠴[0m Running terraform plan [K  [96;1m⠦[0m Running terraform plan [K  [96;1m⠧[0m Running terraform plan [K  [96;1m⠇[0m Running terraform plan [K  [96;1m⠏[0m Running terraform plan [K  [96;1m⠋[0m Running terraform plan [K  [96;1m⠙[0m Running terraform plan [K  [96;1m⠹[0m Running terraform plan [K  [96;1m⠸[0m Running terraform plan [K  [96;1m⠼[0m Running terraform plan [K  [96;1m⠴[0m Running terraform plan [K  [96;1m⠦[0m Running terraform plan [K  [96;1m⠧[0m Running terraform plan [K  [96;1m⠇[0m Running terraform plan [K  [96;1m⠏[0m Running terraform plan [K  [96;1m⠋[0m Running terraform plan [K  [96;1m⠙[0m Running terraform plan [K  [96;1m⠹[0m Running terraform plan [K  [96;1m⠸[0m Running terraform plan [K  [96;1m⠼[0m Running terraform plan [K  [96;1m⠴[0m Running terraform plan [K  [96;1m⠦[0m Running terraform plan [K  [96;1m⠧[0m Running terraform plan [K  [96;1m⠇[0m Running terraform plan [K  [96;1m⠏[0m Running terraform plan [K  [96;1m⠋[0m Running terraform plan [K  [96;1m⠙[0m Running terraform plan [K  [96;1m⠹[0m Running terraform plan [K  [96;1m⠸[0m Running terraform plan [K  [96;1m⠼[0m Running terraform plan [K  [96;1m⠴[0m Running terraform plan [K  [96;1m⠦[0m Running terraform plan [K  [96;1m⠧[0m Running terraform plan [K  [96;1m⠇[0m Running terraform plan [K  [96;1m⠏[0m Running terraform plan [K  [96;1m⠋[0m Running terraform plan [K  [96;1m⠙[0m Running terraform plan [K  [96;1m⠹[0m Running terraform plan [K  [96;1m⠸[0m Running terraform plan [K  [96;1m⠼[0m Running terraform plan [K  [96;1m⠴[0m Running terraform plan [K  [96;1m⠦[0m Running terraform plan [K  [96;1m⠧[0m Running terraform plan [K  [96;1m⠇[0m Running terraform plan [K  [96;1m⠏[0m Running terraform plan [K  [96;1m⠋[0m Running terraform plan [K  [96;1m⠙[0m Running terraform plan [K  [96;1m⠹[0m Running terraform plan [K  [96;1m⠸[0m Running terraform plan [K  [96;1m⠼[0m Running terraform plan [K  [96;1m⠴[0m Running terraform plan [K  [96;1m⠦[0m Running terraform plan [K  [96;1m⠧[0m Running terraform plan [K  [96;1m⠇[0m Running terraform plan [K  [96;1m⠏[0m Running terraform plan [K  [96;1m⠋[0m Running terraform plan [K  [96;1m⠙[0m Running terraform plan [K  [96;1m⠹[0m Running terraform plan [K  [96;1m⠸[0m Running terraform plan [K  [96;1m⠼[0m Running terraform plan [K  [96m✔[0m Running terraform plan
[K  [96;1m⠋[0m Running terraform show [K  [96;1m⠙[0m Running terraform show [K  [96;1m⠹[0m Running terraform show [K  [96;1m⠸[0m Running terraform show [K  [96;1m⠼[0m Running terraform show [K  [96;1m⠴[0m Running terraform show [K  [96;1m⠦[0m Running terraform show [K  [96;1m⠧[0m Running terraform show [K  [96;1m⠇[0m Running terraform show [K  [96;1m⠏[0m Running terraform show [K  [96m✔[0m Running terraform show

[K[96;1m⠋[0m Calculating monthly cost estimate [K[96;1m⠙[0m Calculating monthly cost estimate [K[96m✔[0m Calculating monthly cost estimate

[1mProject:[0m ajinkya101/infracost-azure-atlantis/.

 [4mName[0m                                                     [4mMonthly Qty[0m  [4mUnit[0m                      [4mMonthly Cost[0m 
                                                                                                              
 [1mazurerm_linux_virtual_machine.my_vm[0m                                                                          
 [2m├─[0m Instance usage (pay as you go, Standard_B2ms)                 730  hours                           $60.74 
 [2m└─[0m os_disk                                                                                                   
 [2m   ├─[0m Storage (S4)                                                 1  months                           $1.54 
 [2m   └─[0m Disk operations                             Monthly cost depends on usage: $0.0005 per 10k operations  
                                                                                                              
[1m OVERALL TOTAL[0m                                                                                         $62.27 
----------------------------------
To estimate usage-based resources use --usage-file, see [94mhttps://infracost.io/usage-file[0m

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://infracost1-8687d56d7c-84qqb:4141/lock?id=ajinkya101%252Finfracost-azure-atlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
